j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Where can I get a copy of the Ho`okipa Bill passed by the Senate in 2018?
   CLOSED: [2018-08-04 Sat 18:00]
   :PROPERTIES:
   :EXPORT_FILE_NAME: senate
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
Can I get a digital copy of the Ho`okipa Bill passed by the Senate in 2018?

*** Background:
The Ho`okipa Bill passed third reading, as amended (SD 2). In the vote on the
Senate floor there were 23 ayes, Senator Kim voted aye with reservations, and
Senators Gabbard and Riviere voted no. The Ho`okipa Bill was transmitted to the
House of Representatives on March 6, 2018.

*** Answer:
    Here is a link to a PDF version of the [[https://www.capitol.hawaii.gov/session2018/bills/SB2290_SD2_.PDF][Ho`okipa Bill passed by the Senate in 2018]].
