j20-immigration/content/post/senate.md
+++
title = "Where can I get a copy of the Ho`okipa Bill passed by the Senate in 2018?"
author = ["Hawaii J20"]
date = 2018-08-04T18:00:00-10:00
lastmod = 2018-08-04T18:04:09-10:00
draft = false
[menu.main]
  weight = 2015
  identifier = "where-can-i-get-a-copy-of-the-ho-okipa-bill-passed-by-the-senate-in-2018"
+++

## Question: {#question}

Can I get a digital copy of the Ho\`okipa Bill passed by the Senate in 2018?


## Background: {#background}

The Ho\`okipa Bill passed third reading, as amended (SD 2). In the vote on the
Senate floor there were 23 ayes, Senator Kim voted aye with reservations, and
Senators Gabbard and Riviere voted no. The Ho\`okipa Bill was transmitted to the
House of Representatives on March 6, 2018.


## Answer: {#answer}

Here is a link to a PDF version of the [Ho\`okipa Bill passed by the Senate in 2018](https://www.capitol.hawaii.gov/session2018/bills/SB2290%5FSD2%5F.PDF).
